# ================== SETTINGS ==================

TOKEN = "ADD_YOUR_TOKEN_HERE"
ADMIN_ID = 123456789

BUSINESS_NAME = "Beauty Studio"

# ---- MESSAGES ----

START_TEXT = "Вітаємо у {business}!\nТут ви можете записатися на послугу."

CHOOSE_SERVICE_TEXT = "Оберіть послугу:"
CHOOSE_TIME_TEXT = "Оберіть зручний час:"
ENTER_NAME_TEXT = "Введіть ваше ім'я:"
ENTER_PHONE_TEXT = "Введіть ваш телефон:"

INVALID_PHONE_TEXT = "Введіть будь ласка коректний номер телефону (10–15 цифр, без відступів, можна з +)."

SUCCESS_TEXT = "Дякуємо! Ваша заявка відправлена✅"
CANCEL_TEXT = "Запис скасовано."

# ---- BUTTONS ----

BUTTON_BOOK = "📅 Записатися"
BUTTON_CANCEL = "❌ Скасувати"

# ---- SERVICES & TIME ----

SERVICES = [
    "💇 Стрижка",
    "💅 Манікюр",
    "💆 Массаж"
]

AVAILABLE_TIMES = [
    "10:00", "12:00",
    "14:00", "16:00",
    "18:00"
]

# ================================================
